//
//  Privacy_Text.swift
//  _modooLCK_iOS_
//
//  Created by 나예은 on 2024/10/02.
//  Privacy_Text.Privacy_Text_long
import Foundation

struct Privacy_Text {
    static let Privacy_Text_long = """
    모두의 LCK 개인정보 처리방침

    개인정보 처리방침

    개인정보 처리방침은 모두의 LCK 서비스 제공 개발팀(이하 "팀"이라 합니다)이 특정한 가입절차를 거친 이용자들만 이용 가능한 서비스를 제공함에 있어, 개인정보를 어떻게 수집, 이용, 보관, 파기하는지에 대해 정보를 담은 방침을 의미합니다. 개인정보 처리방침은 개인정보보호법 등 국내 개인정보 보호 법령을 모두 준수하고 있습니다. 본 개인정보 처리방침에서 정하지 않은 용어의 정의는 서비스 이용약관을 따릅니다.

    수집하는 개인정보의 항목

    팀은 서비스 제공을 위해 다음 항목 중 최소한의 개인정보를 수집합니다.

    회원가입 시 수집되는 개인정보
    카카오톡 계정 정보, 닉네임
    별도로 수집되는 개인정보
         1)프로필 사진을 지정할 경우
    프로필 사진
         2)My Team을 지정할 경우
    My Team
         3)게시물의 삭제 또는 반박 내용의 게재를
         요청할 경우
    요청인 및 대리인 정보(이름 및 단체명, 생년월일 및 설립일, 마스킹 된 신분증 사본, 연락처, 이메일, 증빙 자료 사본)
    ※ 각 항목 또는 추가적으로 수집이 필요한 개인정보 및 개인정보를 포함한 자료는 이용자 응대 과정과 서비스 내부 알림 수단 등을 통해 별도의 동의 절차를 거쳐 요청, 수집될 수 있습니다.
    ※ 서비스 이용 과정에서 기기 정보, 이용 기록, 로그 기록이 자동으로 수집될 수 있습니다.
    ※ 서비스 이용 과정에서 자동으로 수집된 정보는 다른 정보와의 결합 여부, 처리 방식 등에 따라 개인정보에 해당하거나 해당하지 않을 수 있으며 팀은 이를 서비스 제공 목적으로 처리할 수 있습니다.

    수집한 개인정보의 처리 목적

    수집된 개인정보는 다음의 목적에 한해 이용됩니다.
    가입 및 탈퇴 의사 확인, 회원 식별 및 관리
    기존, 신규 시스템 개발, 유지, 개선
    불볍, 약관 위반 게시물 게시와 같은 부정행위 방지를 위한 운영 시스템 개발, 유지, 개선
    회원관리, 서비스 운영 및 유지보수를 위한 통계 자료 도출

    개인정보의 처리 및 보유 기간

    팀은 법령에 따른 개인정보 보유 및 이용기간 또는 회원으로부터 개인정보를 수집 시에 동의 받은 개인정보의 보유 및 이용기간 내에서 개인정보를 처리 및 보유합니다.
    각각의 개인정보 처리 및 보유 기간은 다음과 같습니다.
    모두의 LCK 회원 식별 및 관리 : 회원 탈퇴 후 90일까지
    게시글, 댓글 등의 신고 기능을 통해 수집된 개인정보 및 신고 내용 : 1년(단, 본인 확인 용도의 개인정보는 본인 확인 후 즉시 파기합니다.)
    로그 기록 : 1년
    기기 정보 : 1년
    또한, 팀은 1년간 서비스를 이용하지 않은 이용자의 개인정보를 별도로 분리 보관하며, 분리 보관된 개인정보는 3년간 보관 후 지체없이 파기합니다.

    개인정보의 파기
    팀은 탈퇴 및 동의 철회 등 개인정보 수집 및 이용 목적이 달성될 경우, 지체없이 해당 개인정보를 파기합니다.
    회원으로부터 동의 받은 개인정보 보유 기간이 경과하거나 처리 목적이 달성되었음에도 불구하고 다른 법령에 따라 개인정보를 계속 보존해야 하는 경우에는, 해당 개인정보를 별도의 데이터베이스로 옮기거나 보관 장소를 달리하여 보존합니다.
    팀은 위와 같이 파기 사유가 발생한 개인정보는 지체없이 재생이 불가능한 방법으로 파기합니다. 전자적 파일 형태로 기록, 저장되는 개인정보는 기록을 재생할 수 없더록 파기하며, 종이 문서에 기록, 저장된 개인정보는 분쇄기로 분쇄하거나 소각하여 파기합니다.

    개인정보 제공
    팀은 회원의 별도 동의가 있거나 법령에 규정된 경우를 제외하고는 회원의 개인정보를 제3자에게 절대 제공하지 않습니다.
    개인정보 자동 수집 장치의 설치, 운영에 관한 사항
    팀은 로그인을 위한 아이디 식별에 쿠키를 사용합니다.
    정보주체의 권리, 의무 및 행사
    회원은 언제든지 서비스 내부 마이페이지에서 자신의 개인정보를 조회하거나 수정, 삭제, 탈퇴할 수 있으며 모두의 LCK 이메일(modoolck@gmail.com)을 통해 열람, 정정, 삭제, 처리정지 요구 등의 권리를 행사할 수 있습니다. 이에 대해 팀은 지체없이 조치하겠습니다.
    회원의 개인정보 열람, 정정, 삭제, 처리정지 요구는 법률에 특별한 규정이 있는 등의 경우에는 팀이 거절할 수 있습니다. 회원은 팀의 열람 등의 요구 거절에 대하여 모두의 LCK 이메일읕 통해 이의를 제기할 수 있습니다.
    팀은 회원의 정보주체 권리에 따른 열람, 정정, 삭제, 처리정지의 요구 시 요구를 한 이용자가 본인이거나 정당한 법적대리인인지 확인합니다.

    자동화된 결정에 대한 정보주체 권리
    팀은 현행 법률에 따른 청소년유해매체물, 권리 침해, 비정상적인 이용 등의 규칙 위반 행위에 대해 선제적으로 필터링하여 대응할 수 있도록 게시물을 검토하여 규칙 위반 행위를 한 계정에 대하여, 모두의 LCK 서비스 이용약관 제13조(서비스 제공의 중단 및 서비스 이용계약의 해지)에 따라 서비스 제공을 중단하거나 서비스 이용계약을 해지할 수 있습니다.
    회원은 자동화된 결정이 자신의 권리 또는 의무에 영향을 미치는 경우에는 팀에 해당 결정에 대한 설명 또는 검토를 요구할 수 있습니다. 또한 자신의 권리 또는 의무에 대해 본질적인 제한, 박탈 등 중대한 영향을 미치는 경우에는 해당 자동화된 결정에 대해 거부할 수 있습니다.
    다만, 팀은 다른 사람의 생명, 신체, 재산과 그 밖의 이익을 부당하게 침해할 우려가 있는 등 정당한 사유가 있는 경우에는 거부, 설명 등의 요구를 거절할 수 있고, 거절하는 경우에는 그 사유를 정보주체에게 지체없이 알리겠습니다.
    기타
    해당 개인정보 처리방침은 2024년 9월 5일에 작성되었습니다.
    
    
    
    
    
    """
}
